# Before you start :
   - These exercises are related to the Pivot table and correlation lessons.
   - Keep in mind that you need to use some of the functions you learned in the previous lessons.
   - All datasets are provided in the `your-code` folder of this lab.
   - Elaborate your codes and outputs as much as you can.
   - Try your best to answer the questions and complete the tasks and most importantly enjoy the process!!!

#### Import all the libraries that are necessary.

In [1]:
# your answer here
import pandas as pd
import numpy as np

#### Open the ` Employee.csv` file and name your dataset `employee`.

In [5]:
# your answer here
employee = pd.read_csv("./data/Employee.csv")
# Turn everying to snake_case
employee.columns = list(map(lambda x: x.lower(), employee.columns))
employee.columns = employee.columns.str.replace(' ','_')

In [6]:
employee.head()

     name department education gender      title  years  salary
0    Jose         IT  Bachelor      M    analyst      1      35
1   Maria         IT    Master      F    analyst      2      30
2   David         HR    Master      M    analyst      2      30
3   Sonia         HR  Bachelor      F    analyst      4      35
4  Samuel      Sales    Master      M  associate      3      55

#### What's the mean salary by department?
Hint : There are 2 ways to do it - one way is with groupby and the other way is with pivot tables. Do it both ways.

In [12]:
# Method 1
display(employee.groupby(['department']).agg({'salary':np.average}))
display(employee.pivot_table(index = ['department'],values = ['salary'], aggfunc = ['mean']))

            salary
department
HR           45.00
IT           48.75
Sales        55.00

             mean
           salary
department
HR          45.00
IT          48.75
Sales       55.00

#### We want now to group the data by more than one column. Use Pandas pivot table function to select the mean salary by department and title.

In [15]:
# Method 2
display(employee.groupby(['department','title']).agg({'salary':np.average}))
# pivot tables
display(employee.pivot_table(index = ['department','title'],values = ['salary'], aggfunc = ['mean']))
# other way
display(employee.pivot_table(index = ['department'],columns=['title'],values = ['salary'], aggfunc = ['mean']))

                      salary
department title
HR         VP           70.0
           analyst      32.5
IT         VP           70.0
           analyst      32.5
           associate    60.0
Sales      associate    55.0

                       mean
                     salary
department title
HR         VP          70.0
           analyst     32.5
IT         VP          70.0
           analyst     32.5
           associate   60.0
Sales      associate   55.0

             mean
           salary
title          VP analyst associate
department
HR           70.0    32.5       NaN
IT           70.0    32.5      60.0
Sales         NaN     NaN      55.0

#### We want to display the number of years of work experience and the salary for each Title. Add Years as a column in your pivot table.
*Hint: Use Pandas doc(see References in README.md) to explore the pivot_table() arguments*

In [17]:
# groupby
display(employee.groupby(['title']).agg({'years':np.average,'salary':np.average}))
# pivot tables
display(employee.pivot_table(index = ['title'],values = ['years','salary'], aggfunc = ['mean']))
# other way

           years     salary
title
VP          8.00  70.000000
analyst     2.25  32.500000
associate   4.00  56.666667

                mean
              salary years
title
VP         70.000000  8.00
analyst    32.500000  2.25
associate  56.666667  4.00

#### We want to know the information about the mean salary and number of employees in each department and for each job title.

In [ ]:
# your answer here

#### We want to know for each department and for each job title the Salary's median, minimum, maximum and standard deviation. Comment your results.

In [ ]:
# your answer here

#### Based on your comments, fill the missing values with an appropriate value.

In [ ]:
# your answer here

#### The stake holders want to know for each department the number of employees and how much money is spend on salaries. Could you provide that information?

In [ ]:
# your answer here

#### For each Department and Title, we want to know the the total years of work experience and the mean salary.

In [ ]:
# your answer here

### Bonus

#### We now want to compute the mean salary after removing the maxima for each Department. Create the appropriate pivot table.

Hint: Write a custom function.

In [ ]:
# your answer here